# Introduction to Numpy

In [11]:
import numpy as np

In [ ]:
my_list = [1, 2, 3, 4, 5]
my_other_list = [6, 7, 8, 9, 10]

my_list + my_other_list # => [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]


# for i in range(0, len(my_list)):
#     print(my_list[i] + my_other_list[i]) # => 1 2 3 4 5 6 7 8 9 10

my_array = np.array([my_list])
my_other_array = np.array([my_other_list])

my_array + my_other_array # => array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

# Introduction to Pandas

In [1]:
import pandas as pd

In [ ]:
#Series - 1D array with axis labels(index)
my_series = pd.Series([1, 2, 3, 4, 5])
my_other_series = pd.Series([6, 7, 8, 9, 10])


# Adding two Series
my_series + my_other_series # => Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [ ]:
# creating pandas series with labels from list
my_series = pd.Series([1, 2, 3, 4, 5], index=['A', 'B', 'C', 'D', 'E'])

my_series.index # => Index(['A', 'B', 'C', 'D', 'E'], dtype='object')
my_series.values # => array(['A', 'B', 'C', 'D', 'E'])

In [10]:
# Filtering data with conditions
my_series>2

A    False
B    False
C     True
D     True
E     True
dtype: bool

In [11]:
my_series[my_series>2] # => Series[6, 7, 8, 9, 10], index=['A', 'B', 'C', 'D', '

C    3
D    4
E    5
dtype: int64

In [ ]:
import this

In [5]:
# DataFrame - 2D array of Series, each with axis labels(index and columns)

my_dataframe = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})
my_other_dataframe = pd.DataFrame({'A': [6, 7, 8, 9, 10], 'B': [1, 2, 3, 4, 5]})

# Adding two DataFrames
my_dataframe + my_other_dataframe # => DataFrame {{A: 1, B: 6}, {A: 2, B: 7, C: 8}, {A: 3, B: 8, C: 9}, {A: 4, B: 9, C: 10}}

    A   B
0   7   7
1   9   9
2  11  11
3  13  13
4  15  15

In [7]:
Sales = pd.Series([10,20,30,40,50], index = ['Alan', 'Bob', 'Charlie', 'Dave', 'Ed'])

In [8]:
# converting pandas series to dictionary
Sales_dict = Sales.to_dict()
Sales_dict # => {'Bob': 20, 'Ed': 50, 'Dave': 10, 'Alan': 30}

{'Alan': 10, 'Bob': 20, 'Charlie': 30, 'Dave': 40, 'Ed': 50}

In [13]:
# we can create a new series from an already existing series
new_sales = pd.Series(Sales, index = ['Alan', 'Bob', 'Charlie', 'Dave', 'Ed', 'Lucy', 'Sally'])
new_sales

Alan       10.0
Bob        20.0
Charlie    30.0
Dave       40.0
Ed         50.0
Lucy        NaN
Sally       NaN
dtype: float64

In [ ]:
# what is NaN? 
# NaN is a float with a value of None, which may differ from the rest of the values in the series.

In [14]:
# handling missing values with numpy
np.isnan(new_sales)

Alan       False
Bob        False
Charlie    False
Dave       False
Ed         False
Lucy        True
Sally       True
dtype: bool

In [15]:
new_sales[~np.isnan(new_sales)]

Alan       10.0
Bob        20.0
Charlie    30.0
Dave       40.0
Ed         50.0
dtype: float64

In [16]:
# Checking for null values using Pandas
pd.isna(new_sales) # pd.notna() inverts the boolean value.

Alan       False
Bob        False
Charlie    False
Dave       False
Ed         False
Lucy        True
Sally       True
dtype: bool

In [ ]:
pd.isnull(new_sales)

# Pandas DataFrames

DataFrames are two-dimensional, size-mutable, potentially heterogeneous (diverse) tabular data structures. This data structure contains labelled axis (rows and columns).

In [22]:
# creating a dataframe from a dictionary
new_dict = {
    'Name':['Tom','Jane','Steve','Lucy'],
    'Sales':[250,500,350,400],
    'Date': [2022,2020,2021,2022]}

df = pd.DataFrame(new_dict)

df

    Name  Sales  Date
0    Tom    250  2022
1   Jane    500  2020
2  Steve    350  2021
3   Lucy    400  2022

In [25]:
df.values

array([['Tom', 250, 2022],
       ['Jane', 500, 2020],
       ['Steve', 350, 2021],
       ['Lucy', 400, 2022]], dtype=object)

In [26]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Adding a custom index

In [28]:
# we can use the index parameter to add an index
df_index = pd.DataFrame(new_dict, index=['rank1','rank2','rank2','rank3'])
df_index

        Name  Sales  Date
rank1    Tom    250  2022
rank2   Jane    500  2020
rank2  Steve    350  2021
rank3   Lucy    400  2022

In [30]:
df_index.index.name='Rank'

In [31]:
df_index

        Name  Sales  Date
Rank
rank1    Tom    250  2022
rank2   Jane    500  2020
rank2  Steve    350  2021
rank3   Lucy    400  2022

In [32]:
df_index.columns

Index(['Name', 'Sales', 'Date'], dtype='object')

In [33]:
new_dict_v2 = {
    'Name':['Tom','Jane','Steve','Lucy'],
    'Sales':[250,500,350,400],
    'Date': [2022,2020,2021,2022],
    'Rank': ['rank1','rank2','rank2','rank3']
}

df_v2 = pd.DataFrame(new_dict_v2)

df_v2

    Name  Sales  Date   Rank
0    Tom    250  2022  rank1
1   Jane    500  2020  rank2
2  Steve    350  2021  rank2
3   Lucy    400  2022  rank3

In [ ]:
df_rank=df_v2.set_index(['Rank', 'Name'], inplace=True) # set index to be a column name or index number (auto-assigned)

In [58]:
df_v2

             Sales  Date
Rank  Name
rank1 Tom      250  2022
rank2 Jane     500  2020
      Steve    350  2021
rank3 Lucy     400  2022

In [46]:
df_v2.reset_index(inplace=True) # reset index to be a column name or index number (auto-assigned)

In [47]:
df_v2

    Rank   Name  Sales  Date
0  rank1    Tom    250  2022
1  rank2   Jane    500  2020
2  rank2  Steve    350  2021
3  rank3   Lucy    400  2022

In [57]:
df_rank

# Why do we need indexes?
it makes subsetting simpler

# Subsetting DataFrame
it is important to access columns, rows and single elements in your DataFrame easily.
- Square Brackets

- Advanced Methods:
    - loc
    - iloc

In [62]:
type(df_index[['Name']])

pandas.core.frame.DataFrame

In [63]:
type(df_index['Name'])

pandas.core.series.Series

In [64]:
df_index[['Name', 'Sales']]

        Name  Sales
Rank
rank1    Tom    250
rank2   Jane    500
rank2  Steve    350
rank3   Lucy    400

In [70]:
df_index.iloc[0:4,0:2] # loc equivalent

        Name  Sales
Rank
rank1    Tom    250
rank2   Jane    500
rank2  Steve    350
rank3   Lucy    400

In [82]:
df_index[0:4]

        Name  Sales  Date
Rank
rank1    Tom    250  2022
rank2   Jane    500  2020
rank2  Steve    350  2021
rank3   Lucy    400  2022

In [76]:
df_index[df_index['Date']>2020]

        Name  Sales  Date
Rank
rank1    Tom    250  2022
rank2  Steve    350  2021
rank3   Lucy    400  2022

In [78]:
df_index[(df_index['Date'] > 2020) & (df_index['Sales'] > 300)]

        Name  Sales  Date
Rank
rank2  Steve    350  2021
rank3   Lucy    400  2022

# ISIN

In [81]:
# show me records for data 2020 and 2022
df_index[(df_index['Date']==2020) & (df_index['Date']==2022)]
df_index[df_index['Date'].isin([2020, 2022])]

       Name  Sales  Date
Rank
rank1   Tom    250  2022
rank2  Jane    500  2020
rank3  Lucy    400  2022

# loc and iloc

loc[row_label, column_label]

iloc[row_index, column_index]

# loc

In [83]:
df_index.loc['rank2' : 'rank3', ['Name', 'Sales']]

        Name  Sales
Rank
rank2   Jane    500
rank2  Steve    350
rank3   Lucy    400

In [85]:
df_index.loc[df_index['Date'].isin([2020, 2022]), ['Name', 'Date', 'Sales']]

       Name  Date  Sales
Rank
rank1   Tom  2022    250
rank2  Jane  2020    500
rank3  Lucy  2022    400

# iloc

In [88]:
df_index.iloc[0:2, 0:2] # rows, columns

       Name  Sales
Rank
rank1   Tom    250
rank2  Jane    500

# Assignment:  
# Pre-defined lists
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right =  [True, False, False, False, True, True, True]
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
row_labels = ['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG']

#step1: Create dictionary my_dict with three key:value pairs: my_dict
 
#step2 Build a DataFrame cars from my_dict: cars
 
#step3 print cars
 
#step4 specify the row labels of cars
 
#step5 print cars again
 
#step6 Print out country column as Pandas Series
 
#step7 Print out country column as Pandas DataFrame
 
#step8 Print out DataFrame with country and drives_right columns
 
#step9 Print out first 3 observations
 
#step10 Print out fourth, fifth and sixth observation
 
#step11 Print out observation for Japan
 
#step12 Print out observations for Australia and Egypt
 
#step13 Print out drives_right value of Morocco

In [ ]:
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right =  [True, False, False, False, True, True, True]
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
row_labels = ['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG']

# create dictionary with 3 key.value pairs
my_dict = {'Country': country, 'Drives Right': drives_right, 'Cars per capita': cars_per_cap}

In [94]:
Cars = pd.DataFrame(my_dict)

In [95]:
print(Cars)

         Country  Drives Right  Cars per capita
0  United States          True              809
1      Australia         False              731
2          Japan         False              588
3          India         False               18
4         Russia          True              200
5        Morocco          True               70
6          Egypt          True               45

In [96]:
Cars.index = row_labels

In [97]:
Cars.index

Index(['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG'], dtype='object')

In [98]:
print(Cars)

           Country  Drives Right  Cars per capita
US   United States          True              809
AUS      Australia         False              731
JPN          Japan         False              588
IN           India         False               18
RU          Russia          True              200
MOR        Morocco          True               70
EG           Egypt          True               45

In [100]:
# print out Country column as Panda Series
print(pd.Series(Cars['Country']))

US     United States
AUS        Australia
JPN            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: Country, dtype: object

In [104]:
print(pd.DataFrame(Cars['Country']))

           Country
US   United States
AUS      Australia
JPN          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt

In [107]:
print(pd.DataFrame({'Country': Cars['Country'], 'Drives Right': Cars['Drives Right']}))

           Country  Drives Right
US   United States          True
AUS      Australia         False
JPN          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

In [141]:
Cars.iloc[:3]

           Country  Drives Right  Cars per capita
US   United States          True              809
AUS      Australia         False              731
JPN          Japan         False              588

In [151]:
Cars.iloc[4:7]

     Country  Drives Right  Cars per capita
RU    Russia          True              200
MOR  Morocco          True               70
EG     Egypt          True               45

In [144]:
Cars.iloc[2]

Country            Japan
Drives Right       False
Cars per capita      588
Name: JPN, dtype: object

In [155]:
Cars.iloc[[1, 6]]

       Country  Drives Right  Cars per capita
AUS  Australia         False              731
EG       Egypt          True               45

In [158]:
Cars.iloc[[5],[1]]

     Drives Right
MOR          True

# Summary, Statistics and Group By

In [162]:
df = pd.read_csv('gapminder.csv')
df.head(10) # df.tail(10)

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap
0,11,Afghanistan,2007,31889923.0,Asia,43.828,974.580338
1,23,Albania,2007,3600523.0,Europe,76.423,5937.029526
2,35,Algeria,2007,33333216.0,Africa,72.301,6223.367465
3,47,Angola,2007,12420476.0,Africa,42.731,4797.231267
4,59,Argentina,2007,40301927.0,Americas,75.320,12779.379640
5,71,Australia,2007,20434176.0,Oceania,81.235,34435.367440
6,83,Austria,2007,8199783.0,Europe,79.829,36126.492700
7,95,Bahrain,2007,708573.0,Asia,75.635,29796.048340
8,107,Bangladesh,2007,150448339.0,Asia,64.062,1391.253792
9,119,Belgium,2007,10392226.0,Europe,79.441,33692.605080

In [163]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142 entries, 0 to 141
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  142 non-null    int64
 1   country     142 non-null    object
 2   year        142 non-null    int64
 3   population  142 non-null    float64
 4   cont        142 non-null    object
 5   life_exp    142 non-null    float64
 6   gdp_cap     142 non-null    float64
dtypes: float64(3), int64(2), object(2)
memory usage: 7.9+ KB

In [164]:
df.describe()

        Unnamed: 0    year    population    life_exp       gdp_cap
count   142.000000   142.0  1.420000e+02  142.000000    142.000000
mean    857.000000  2007.0  4.402122e+07   67.007423  11680.071820
std     493.631441     0.0  1.476214e+08   12.073021  12859.937337
min      11.000000  2007.0  1.995790e+05   39.613000    277.551859
25%     434.000000  2007.0  4.508034e+06   57.160250   1624.842248
50%     857.000000  2007.0  1.051753e+07   71.935500   6124.371108
75%    1280.000000  2007.0  3.121004e+07   76.413250  18008.835640
max    1703.000000  2007.0  1.318683e+09   82.603000  49357.190170

In [165]:
df.max()

Unnamed: 0            1703
country           Zimbabwe
year                  2007
population    1318683096.0
cont               Oceania
life_exp            82.603
gdp_cap        49357.19017
dtype: object

# Group By

In [167]:
df_cont_wise = df.groupby('cont')

In [168]:
df_cont_wise

In [176]:
df_cont_wise[['life_exp', 'gdp_cap', 'population']].mean()

           life_exp       gdp_cap    population
cont
Africa    54.806038   3089.032605  1.787576e+07
Americas  73.608120  11003.031625  3.595485e+07
Asia      70.728485  12473.026870  1.155138e+08
Europe    77.648600  25054.481636  1.953662e+07
Oceania   80.719500  29810.188275  1.227497e+07

# agg() Method

In [184]:
df_cont_wise.agg({'life_exp' : 'mean', 'population' : 'max'})
# df_cont_wise[['life_exp', 'population']].agg([np.mean, len])

           life_exp    population
cont
Africa    54.806038  1.350312e+08
Americas  73.608120  3.011399e+08
Asia      70.728485  1.318683e+09
Europe    77.648600  8.240100e+07
Oceania   80.719500  2.043418e+07

In [185]:
df_cont_wise.agg({'life_exp' :['mean', 'sum', 'min', 'max']})

           life_exp
               mean       sum     min     max
cont
Africa    54.806038  2849.914  39.613  76.442
Americas  73.608120  1840.203  60.916  80.653
Asia      70.728485  2334.040  43.828  82.603
Europe    77.648600  2329.458  71.777  81.757
Oceania   80.719500   161.439  80.204  81.235

# Sort

In [190]:
df.sort_values(by=['cont', 'population'], ascending=[False, False]) #ascending default True

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap
5,71,Australia,2007,20434176.0,Oceania,81.235,34435.367440
91,1103,New Zealand,2007,4115771.0,Oceania,80.204,25185.009110
47,575,Germany,2007,82400996.0,Europe,79.406,32170.374420
131,1583,Turkey,2007,71158647.0,Europe,71.777,8458.276384
44,539,France,2007,61083916.0,Europe,80.657,30470.016700
...,...,...,...,...,...,...,...
105,1271,Reunion,2007,798094.0,Africa,76.442,7670.122558
26,323,Comoros,2007,710960.0,Africa,65.152,986.147879
40,491,Equatorial Guinea,2007,551201.0,Africa,51.579,12154.089750
35,431,Djibouti,2007,496374.0,Africa,54.791,2082.481567
108,1307,Sao Tome and Principe,2007,199579.0,Africa,65.528,1598.435089